# ================= Set - множества ================
# Через фигурные скобки
a = {1, 2, 3, 4}

# Через функцию set() (в том числе для удаления дубликатов из списка)
str_list = ['JS', 'TS', 'TS', 'Python', 'GO', 'GO']
b = set(
    str_list
)  # получится {'GO', 'Python', 'JS', 'TS'} - порядок строк произвольно меняется
print(b)

# Пустое множество создается только через set(), так как {} - это пустой словарь
empty_set = set()

# Замороженное (неизменяемое) множество
c = frozenset([1, 2, 3])

# --------------------- Методы -------------------------
s = set()

print('Empty set:', s)

# Добавление:
s.add(1)  # добавляет один элемент.
s.update([2, 3, 4])  # добавляет несколько элементов из другой коллекции.

print('Added set:', s)

# Удаление:
s.remove(3)  # удаляет элемент (вызовет ошибку KeyError, если его нет).
s.discard(2)  # удаляет элемент (ошибку не вызывает, если элемента нет).

print('Deleted set:', s)

print(s.pop())  # удаляет и возвращает случайный элемент.
s.clear()  # очищает всё множество.
print('Clear set:', s)

# -------------- Математические операции ----------------
s1 = {1, 2, 3, 4}
s2 = {3, 4, 5, 6, 7}

print(
    'Union set:', s1.union(s2)
)  # {1, 2, 3, 4, 5, 6, 7} - объединение множеств, с удалением дубликатов
print(s1 | s2)  # или так

print(
    'Intersection set:', s1.intersection(s2)
)  # {3, 4} - пересечение: только общие элементы двух множеств
print(s1 & s2)  # или так

print(
    'Difference set:', s1.difference(s2)
)  # {1, 2} - разность: элементы из s1, которых нет в s2
print(s1 - s2)  # или так
print(s2 - s1)  # или так {5, 6, 7}

print(
    'Symmetric difference set:', s1.symmetric_difference(s2)
)  # {1, 2, 5, 6, 7} - симметрическая разность: элементы, которые есть только в одном из множеств
print(s1 ^ s2)  # или так
